csm7/NRF52_repeatChar/main.c
}

/**@brief Function for handling Queued Write Module errors.
 *
 * @details A pointer to this function will be passed to each service which may need to inform the
 *          application about an error.
 *
 * @param[in]   nrf_error   Error code containing information about what went wrong.
 */
static void nrf_qwr_error_handler(uint32_t nrf_error)
{
	APP_ERROR_HANDLER(nrf_error);
}

/**@brief Function for initializing the sensor simulators.
 */
static void sensor_simulator_init(void)
{
	m_battery_sim_cfg.min          = MIN_BATTERY_LEVEL;
	m_battery_sim_cfg.max          = MAX_BATTERY_LEVEL;
	m_battery_sim_cfg.incr         = BATTERY_LEVEL_INCREMENT;
	m_battery_sim_cfg.start_at_max = true;

	sensorsim_init(&m_battery_sim_state, &m_battery_sim_cfg);

	// Simulated measurement #1.
	m_bps_meas_sim_val[0].systolic.mantissa      = SIM_MEAS_1_SYSTOLIC;
	m_bps_meas_sim_val[0].systolic.exponent      = 0;
	m_bps_meas_sim_val[0].diastolic.mantissa     = SIM_MEAS_1_DIASTOLIC;
	m_bps_meas_sim_val[0].diastolic.exponent     = 0;
	m_bps_meas_sim_val[0].mean_arterial.mantissa = SIM_MEAS_1_MEAN_AP;
	m_bps_meas_sim_val[0].mean_arterial.exponent = 0;
	m_bps_meas_sim_val[0].pulse_rate.mantissa    = SIM_MEAS_1_PULSE_RATE;
	m_bps_meas_sim_val[0].pulse_rate.exponent    = 0;

	// Simulated measurement #2.
	m_bps_meas_sim_val[1].systolic.mantissa      = SIM_MEAS_2_SYSTOLIC;
	m_bps_meas_sim_val[1].systolic.exponent      = 0;
	m_bps_meas_sim_val[1].diastolic.mantissa     = SIM_MEAS_2_DIASTOLIC;
	m_bps_meas_sim_val[1].diastolic.exponent     = 0;
	m_bps_meas_sim_val[1].mean_arterial.mantissa = SIM_MEAS_2_MEAN_AP;
	m_bps_meas_sim_val[1].mean_arterial.exponent = 0;
	m_bps_meas_sim_val[1].pulse_rate.mantissa    = SIM_MEAS_2_PULSE_RATE;
	m_bps_meas_sim_val[1].pulse_rate.exponent    = 0;

	// Simulated measurement #3.
	m_bps_meas_sim_val[2].systolic.mantissa      = SIM_MEAS_3_SYSTOLIC;
	m_bps_meas_sim_val[2].systolic.exponent      = 0;
	m_bps_meas_sim_val[2].diastolic.mantissa     = SIM_MEAS_3_DIASTOLIC;
	m_bps_meas_sim_val[2].diastolic.exponent     = 0;
	m_bps_meas_sim_val[2].mean_arterial.mantissa = SIM_MEAS_3_MEAN_AP;
	m_bps_meas_sim_val[2].mean_arterial.exponent = 0;
	m_bps_meas_sim_val[2].pulse_rate.mantissa    = SIM_MEAS_3_PULSE_RATE;
	m_bps_meas_sim_val[2].pulse_rate.exponent    = 0;

	// Simulated measurement #4.
	m_bps_meas_sim_val[3].systolic.mantissa      = SIM_MEAS_4_SYSTOLIC;
	m_bps_meas_sim_val[3].systolic.exponent      = 0;
	m_bps_meas_sim_val[3].diastolic.mantissa     = SIM_MEAS_4_DIASTOLIC;
	m_bps_meas_sim_val[3].diastolic.exponent     = 0;
	m_bps_meas_sim_val[3].mean_arterial.mantissa = SIM_MEAS_4_MEAN_AP;
	m_bps_meas_sim_val[3].mean_arterial.exponent = 0;
	m_bps_meas_sim_val[3].pulse_rate.mantissa    = SIM_MEAS_4_PULSE_RATE;
	m_bps_meas_sim_val[3].pulse_rate.exponent    = 0;
}


/**@brief Function for populating simulated blood pressure measurements.
 */
static void bps_sim_measurement(ble_bps_meas_t * p_meas)
{
	static ble_date_time_t s_time_stamp = { 2012, 12, 5, 11, 05, 03 };
	static uint8_t         s_ndx        = 0;

	p_meas->blood_pressure_units_in_kpa = false;
	p_meas->time_stamp_present          = (s_ndx == 0) || (s_ndx == 2);
	p_meas->pulse_rate_present          = (s_ndx == 0) || (s_ndx == 1);
	p_meas->user_id_present             = false;
	p_meas->measurement_status_present  = false;

	p_meas->blood_pressure_systolic.mantissa = m_bps_meas_sim_val[s_ndx].systolic.mantissa;
	p_meas->blood_pressure_systolic.exponent = m_bps_meas_sim_val[s_ndx].systolic.exponent;

	p_meas->blood_pressure_diastolic.mantissa = m_bps_meas_sim_val[s_ndx].diastolic.mantissa;
	p_meas->blood_pressure_diastolic.exponent = m_bps_meas_sim_val[s_ndx].diastolic.exponent;

	p_meas->mean_arterial_pressure.mantissa = m_bps_meas_sim_val[s_ndx].mean_arterial.mantissa;
	p_meas->mean_arterial_pressure.exponent = m_bps_meas_sim_val[s_ndx].mean_arterial.exponent;

	p_meas->time_stamp = s_time_stamp;

	p_meas->pulse_rate.mantissa = m_bps_meas_sim_val[s_ndx].pulse_rate.mantissa;
	p_meas->pulse_rate.exponent = m_bps_meas_sim_val[s_ndx].pulse_rate.exponent;

	// Update index to simulated measurements.
	s_ndx++;
	if (s_ndx == NUM_SIM_MEAS_VALUES)
	{
		s_ndx = 0;
	}

	// Update simulated time stamp.
	s_time_stamp.seconds += 27;
	if (s_time_stamp.seconds > 59)
	{
		s_time_stamp.seconds -= 60;

		s_time_stamp.minutes++;
		if (s_time_stamp.minutes > 59)
		{
			s_time_stamp.minutes = 0;
		}
	}
}


/**@brief Function for simulating and sending one Blood Pressure Measurement.
 */
static void blood_pressure_measurement_send(void)
{
	ble_bps_meas_t simulated_meas;
	uint32_t       err_code;
	bool           is_indication_enabled;

	err_code = ble_bps_is_indication_enabled(&m_bps, &is_indication_enabled);
	APP_ERROR_CHECK(err_code);

	if (is_indication_enabled && !m_bps_meas_ind_conf_pending)
	{
		bps_sim_measurement(&simulated_meas);

		err_code = ble_bps_measurement_send(&m_bps, &simulated_meas);

		switch (err_code)
		{
		case NRF_SUCCESS:
			// Measurement was successfully sent, wait for confirmation.
			m_bps_meas_ind_conf_pending = true;
			break;

		case NRF_ERROR_INVALID_STATE:
			// Ignore error.
			break;

		default:
			APP_ERROR_HANDLER(err_code);
			break;
		}
	}
}

/**@brief Function for handling Peer Manager events.
 *
 * @param[in] p_evt  Peer Manager event.
 */
static void pm_evt_handler(pm_evt_t const * p_evt)
{
	ret_code_t err_code;
	bool       is_indication_enabled;

	pm_handler_on_pm_evt(p_evt);
	pm_handler_flash_clean(p_evt);

	switch (p_evt->evt_id)
	{
	case PM_EVT_CONN_SEC_SUCCEEDED:
		// Send a single blood pressure measurement if indication is enabled.
		// NOTE: For this to work, make sure ble_bps_on_ble_evt() is called before
		// ble_bondmngr_on_ble_evt() in ble_evt_dispatch().
		err_code = ble_bps_is_indication_enabled(&m_bps, &is_indication_enabled);
		APP_ERROR_CHECK(err_code);

		if (is_indication_enabled)
		{
			blood_pressure_measurement_send();
		}
		break;

	case PM_EVT_PEERS_DELETE_SUCCEEDED:
		advertising_start(false);
		break;

	default:
		break;
	}
}


