csm7/NRF52_repeatChar/main.c
/**@brief Function for handling the Blood Pressure Service events.
 *
 * @details This function will be called for all Blood Pressure Service events which are passed to
 *          the application.
 *
 * @param[in]   p_bps   Blood Pressure Service structure.
 * @param[in]   p_evt   Event received from the Blood Pressure Service.
 */
static void on_bps_evt(ble_bps_t * p_bps, ble_bps_evt_t * p_evt)
{
	switch (p_evt->evt_type)
	{
	case BLE_BPS_EVT_INDICATION_ENABLED:
		// Indication has been enabled, send a single blood pressure measurement.
		blood_pressure_measurement_send();
		break;

	case BLE_BPS_EVT_INDICATION_CONFIRMED:
		m_bps_meas_ind_conf_pending = false;
		break;

	default:
		// No implementation needed.
		break;
	}
}

/**@brief Function for initializing services that will be used by the application.
 *
 * @details Initialize the Blood Pressure, Battery, and Device Information services.
 */
static void services_init(void)
{
	uint32_t err_code;
	ble_bps_init_t bps_init;
	ble_bas_init_t     bas_init;
  ble_dis_init_t dis_init;
	ble_dis_sys_id_t sys_id;
	nrf_ble_qwr_init_t qwr_init = { 0 };

	// Initialize Queued Write Module
  qwr_init.error_handler = nrf_qwr_error_handler;

	err_code = nrf_ble_qwr_init(&m_qwr, &qwr_init);
	APP_ERROR_CHECK(err_code);

	// Initialize Blood Pressure Service.
  memset(&bps_init, 0, sizeof(bps_init));

	bps_init.evt_handler = on_bps_evt;
	bps_init.error_handler = service_error_handler;
	bps_init.p_gatt_queue = &m_ble_gatt_queue;
	bps_init.feature = BLE_BPS_FEATURE_BODY_MOVEMENT_BIT |
	                    BLE_BPS_FEATURE_MEASUREMENT_POSITION_BIT;

	// Here the sec level for the Blood Pressure Service can be changed/increased.
  bps_init.bp_cccd_wr_sec = SEC_JUST_WORKS;
	bps_init.bp_feature_rd_sec = SEC_OPEN;

	err_code = ble_bps_init(&m_bps, &bps_init);
	APP_ERROR_CHECK(err_code);

	// Initialize Battery Service.
	memset(&bas_init, 0, sizeof(bas_init));

	// Here the sec level for the Battery Service can be changed/increased.
	bas_init.bl_rd_sec        = SEC_OPEN;
	bas_init.bl_cccd_wr_sec   = SEC_OPEN;
	bas_init.bl_report_rd_sec = SEC_OPEN;

	bas_init.evt_handler          = NULL;
	bas_init.support_notification = true;
	bas_init.p_report_ref         = NULL;
	bas_init.initial_batt_level   = 100;

	err_code = ble_bas_init(&m_bas, &bas_init);
	APP_ERROR_CHECK(err_code);

	// Initialize Device Information Service.
	memset(&dis_init, 0, sizeof(dis_init));

	ble_srv_ascii_to_utf8(&dis_init.manufact_name_str, MANUFACTURER_NAME);
	ble_srv_ascii_to_utf8(&dis_init.model_num_str, MODEL_NUM);

	sys_id.manufacturer_id            = MANUFACTURER_ID;
	sys_id.organizationally_unique_id = ORG_UNIQUE_ID;
	dis_init.p_sys_id                 = &sys_id;

	dis_init.dis_char_rd_sec = SEC_OPEN;

	err_code = ble_dis_init(&dis_init);
	APP_ERROR_CHECK(err_code);

}

/**@brief Function for the GAP initialization.
 *
 * @details This function sets up all the necessary GAP (Generic Access Profile) parameters of the
 *          device including the device name, appearance, and the preferred connection parameters.
 */
static void gap_params_init(void)
{
	uint32_t    err_code;
	ble_gap_conn_params_t gap_conn_params;
	ble_gap_conn_sec_mode_t sec_mode;

	BLE_GAP_CONN_SEC_MODE_SET_OPEN(&sec_mode);
	err_code = sd_ble_gap_device_name_set(&sec_mode,
		                                    (const uint8_t *)DEVICE_NAME,
		                                     strlen(DEVICE_NAME));
	APP_ERROR_CHECK(err_code);

	err_code = sd_ble_gap_appearance_set(BLE_APPEARANCE_GENERIC_BLOOD_PRESSURE);
	APP_ERROR_CHECK(err_code);

	memset(&gap_conn_params, 0, sizeof(gap_conn_params));

	gap_conn_params.min_conn_interval = MIN_CONN_INTERVAL;
	gap_conn_params.max_conn_interval = MAX_CONN_INTERVAL;
	gap_conn_params.slave_latency = SLAVE_LATENCY;
	gap_conn_params.conn_sup_timeout = CONN_SUP_TIMEOUT;

	err_code = sd_ble_gap_ppcp_set(&gap_conn_params);
	APP_ERROR_CHECK(err_code);
}

/**@brief Function for initializing the GATT module.
 */
static void gatt_init(void)
{
	ret_code_t err_code = nrf_ble_gatt_init(&m_gatt, NULL);
	APP_ERROR_CHECK(err_code);
}

/**@brief Function for handling the Connection Parameter events.
 *
 * @details This function will be called for all events in the Connection Parameters Module which
 *          are passed to the application.
 *          @note All this function does is to disconnect. This could have been done by simply
 *                setting the disconnect_on_fail configuration parameter, but instead we use the
 *                event handler mechanism to demonstrate its use.
 *
 * @param[in]   p_evt   Event received from the Connection Parameters Module.
 */
static void on_conn_params_evt(ble_conn_params_evt_t * p_evt)
{
	ret_code_t err_code;

	if (p_evt->evt_type == BLE_CONN_PARAMS_EVT_FAILED)
	{
		err_code = sd_ble_gap_disconnect(m_conn_handle, BLE_HCI_CONN_INTERVAL_UNACCEPTABLE);
		APP_ERROR_CHECK(err_code);
	}
}

/**@brief Function for handling a Connection Parameters error.
 *
 * @param[in]   nrf_error   Error code containing information about what went wrong.
 */
static void conn_params_error_handler(uint32_t nrf_error)
{
	APP_ERROR_HANDLER(nrf_error);
}


/**@brief Function for initializing the Connection Parameters module.
 */
static void conn_params_init(void)
{
	uint32_t               err_code;
	ble_conn_params_init_t connection_params_init;

	memset(&connection_params_init, 0, sizeof(connection_params_init));

	connection_params_init.p_conn_params                  = NULL;
	connection_params_init.first_conn_params_update_delay = FIRST_CONN_PARAMS_UPDATE_DELAY;
	connection_params_init.next_conn_params_update_delay  = NEXT_CONN_PARAMS_UPDATE_DELAY;
	connection_params_init.max_conn_params_update_count   = MAX_CONN_PARAMS_UPDATE_COUNT;
	connection_params_init.start_on_notify_cccd_handle    = BLE_GATT_HANDLE_INVALID;
	connection_params_init.disconnect_on_fail             = false;
	connection_params_init.evt_handler                    = on_conn_params_evt;
	connection_params_init.error_handler                  = conn_params_error_handler;

